tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# The fastest shell plugin manager
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
brew "coreutils"
# command-line HTTP client
brew "curl"
brew "gettext"
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
brew "jq"
# Pager program simliar to more
brew "less"
# Modern and fast text editor fully compatible with Vim.
brew "neovim"
brew "nvm"
# UNIX shell (command interpreter)
brew "zsh"

# Bash scripts that integrate bat with various command-line tools
cask "brave-browser"
cask "font-fira-code"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "raycast"
cask "visual-studio-code"

vscode "adam-bender.commit-message-editor"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "ambooth.git-rename"
vscode "astro-build.astro-vscode"
vscode "azurite.azurite"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "codestream.codestream"
vscode "continue.continue"
vscode "csstools.postcss"
vscode "danielsanmedium.dscodegpt"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "ionide.ionide-fake"
vscode "ionide.ionide-fsharp"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-logicapps"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "openxcom.ruleset-tools"
vscode "orta.vscode-jest"
vscode "orta.vscode-react-native-storybooks"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "robertz.code-snapshot"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sohamkamani.code-eol"
vscode "solomonkinard.git-blame"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "yrm.type-challenges"
vscode "yzhang.markdown-all-in-one"
