tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "jackielii/tap"

cask_args no_quarantine: true, no_binaries: true

brew "antidote" # The fastest shell plugin manager
brew 'bash' # Latest Bash version
brew "bat"  # Clone of cat(1) with syntax highlighting and Git integration
brew "commitizen" # Conventional commit helper
brew "coreutils"
brew "curl" # command-line HTTP client
brew "fzf" # Fuzzy finder
brew "gettext"
brew "gifski" # Convert videos to high-quality GIFs
brew "httpie"# User-friendly cURL replacement (command-line HTTP client)
brew "jq" # User-friendly cURL replacement (command-line HTTP client)
brew "koekeishiya/formulae/yabai" # Tiling window manager for macOS
brew "jackielii/tap/skhd-zig" # Simple hotkey daemon for macOS (Zig implementation)
brew "less"
brew 'mackup' # Backup and restore app settings on macOS
brew "mas" # Mac App Store CLI
brew "neovim"
brew "nextdns" # VPN client
brew "tldr" # Simplified and community-driven
# Git
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "gh" # GitHub CLI
brew "delta" # Better git diff viewer
brew "lazygit" # Terminal UI for git

# UNIX shell
brew "eza"
brew "tmux"
brew "zoxide"
brew "zsh"
brew "ripgrep" # Better grep (rg)
brew "fd" # Better find
brew "direnv" # Load/unload env vars by directory
brew "atuin" # Magical shell history with sync
brew "btop" # Beautiful system monitor
brew "trash-cli" # Safe rm alternative
brew "starship" # Cross-shell prompt (alternative to Powerlevel10k)

# Node
brew "fnm" # Node version manager

# Streaming & RDP
brew "moonlight-qt" # Moonlight game streaming client
brew "sunshine" # Sunshine streaming server

# Development Workspaces
brew "coder" # Coder CLI for remote dev workspaces

cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alacritty"
cask "appcleaner"
cask "brave-browser"
cask "caffeine"
cask "devcleaner"  # Remove Xcode caches and unused simulators
cask "discord"
cask "google-chrome"
cask "hiddenbar"
cask "latest"
cask "little-snitch"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "micro-snitch"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "obs"
cask "ollama"
cask "orbstack" # Docker/container management
cask "plex"
cask "raycast"
cask "rocket"
cask "screen-studio"
cask "shottr"
cask "transmit"
cask "tripmode"
cask "visual-studio-code"
cask "whatsapp"
cask "wifiman"

# Quicklook
cask 'qlmarkdown' # $ xattr -r -d com.apple.quarantine "FULL PATH OF THE QLMarkdown.app (you can drag the file to get the pull path)" - https://github.com/sbarex/QLMarkdown
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Data Jar', id: 1453273600 # Store and access data
mas 'Dropover - Easier Drag & Drop', id: 1355679052 # Drag and drop files easily
mas 'Capo', id: 1355679052