tap "cloudflare/cloudflare"
tap "homebrew/bundle"

cask_args no_quarantine: true, no_binaries: true

brew "antidote" # The fastest shell plugin manager
brew 'bash' # Latest Bash version
brew "bat"  # Clone of cat(1) with syntax highlighting and Git integration
brew "commitizen" # Conventional commit helper
brew "coreutils"
brew "curl" # command-line HTTP client
brew "gettext"
brew "httpie"# User-friendly cURL replacement (command-line HTTP client)
brew "jq" # User-friendly cURL replacement (command-line HTTP client)
brew "less"
brew 'mackup' # Backup and restore app settings on macOS
brew "mas" # Mac App Store CLI
brew "neovim"
brew "nextdns" # VPN client
# Git
brew "git"
brew "git-extras"
brew "git-quick-stats"
# UNIX shell
brew "eza"
brew "tmux"
brew "zoxide"
brew "zsh"
# Node
brew "fnm" # Node version manager

cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alacritty"
cask "appcleaner"
cask 'bartender' # Organize menu bar icons
cask "brave-browser"
cask "caffeine"
cask "devcleaner"  # Remove Xcode caches and unused simulators
cask "deepl"
cask "discord"
cask "docker"
cask "google-chrome"
cask "hazel"
# cask "hiddenbar"
cask "latest"
cask "little-snitch"
cask "gifski"
cask "figma"
cask "micro-snitch"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "nextdns"
cask "obs"
cask "ollama"
cask "plex"
cask "raycast"
cask "screen-studio"
cask "shottr"
cask "transit"
cask "tripmode"
cask "ubiquiti-unifi-controller"
cask "visual-studio-code"
cask "whatsapp"
cask "wifiman"

# Quicklook
cask 'qlmarkdown' # $ xattr -r -d com.apple.quarantine "FULL PATH OF THE QLMarkdown.app (you can drag the file to get the pull path)" - https://github.com/sbarex/QLMarkdown
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Data Jar', id: 1453273600 # Store and access data
mas 'Dropover - Easier Drag & Drop', id: 1355679052 # Drag and drop files easily
mas 'Xcode', id: 497799835
mas 'Pandan', id: 1569600264
mas 'Camera Preview', id: 1632827132
mas 'Capo', id: 1355679052

vscode "adpyke.codesnap"
vscode "ambooth.git-rename"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "danielsanmedium.dscodegpt"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "openxcom.ruleset-tools"
vscode "orta.vscode-jest"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "yrm.type-challenges"
vscode "yzhang.markdown-all-in-one"
vscode "wakatime.vscode-wakatime"